codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl036.h
#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_w_POSITION                         0x00000000
#define _IPC0_w_MASK                             0xFFFFFFFF
#define _IPC0_w_LENGTH                           0x00000020

#define _IPC1_INT1IS_POSITION                    0x00000000
#define _IPC1_INT1IS_MASK                        0x00000003
#define _IPC1_INT1IS_LENGTH                      0x00000002

#define _IPC1_INT1IP_POSITION                    0x00000002
#define _IPC1_INT1IP_MASK                        0x0000001C
#define _IPC1_INT1IP_LENGTH                      0x00000003

#define _IPC1_INT2IS_POSITION                    0x00000008
#define _IPC1_INT2IS_MASK                        0x00000300
#define _IPC1_INT2IS_LENGTH                      0x00000002

#define _IPC1_INT2IP_POSITION                    0x0000000A
#define _IPC1_INT2IP_MASK                        0x00001C00
#define _IPC1_INT2IP_LENGTH                      0x00000003

#define _IPC1_INT3IS_POSITION                    0x00000010
#define _IPC1_INT3IS_MASK                        0x00030000
#define _IPC1_INT3IS_LENGTH                      0x00000002

#define _IPC1_INT3IP_POSITION                    0x00000012
#define _IPC1_INT3IP_MASK                        0x001C0000
#define _IPC1_INT3IP_LENGTH                      0x00000003

#define _IPC1_INT4IS_POSITION                    0x00000018
#define _IPC1_INT4IS_MASK                        0x03000000
#define _IPC1_INT4IS_LENGTH                      0x00000002

#define _IPC1_INT4IP_POSITION                    0x0000001A
#define _IPC1_INT4IP_MASK                        0x1C000000
#define _IPC1_INT4IP_LENGTH                      0x00000003

#define _IPC1_w_POSITION                         0x00000000
#define _IPC1_w_MASK                             0xFFFFFFFF
#define _IPC1_w_LENGTH                           0x00000020

#define _IPC2_CNAIS_POSITION                     0x00000000
#define _IPC2_CNAIS_MASK                         0x00000003
#define _IPC2_CNAIS_LENGTH                       0x00000002

#define _IPC2_CNAIP_POSITION                     0x00000002
#define _IPC2_CNAIP_MASK                         0x0000001C
#define _IPC2_CNAIP_LENGTH                       0x00000003

#define _IPC2_CNBIS_POSITION                     0x00000008
#define _IPC2_CNBIS_MASK                         0x00000300
#define _IPC2_CNBIS_LENGTH                       0x00000002

#define _IPC2_CNBIP_POSITION                     0x0000000A
#define _IPC2_CNBIP_MASK                         0x00001C00
#define _IPC2_CNBIP_LENGTH                       0x00000003

#define _IPC2_CNCIS_POSITION                     0x00000010
#define _IPC2_CNCIS_MASK                         0x00030000
#define _IPC2_CNCIS_LENGTH                       0x00000002

#define _IPC2_CNCIP_POSITION                     0x00000012
#define _IPC2_CNCIP_MASK                         0x001C0000
#define _IPC2_CNCIP_LENGTH                       0x00000003

#define _IPC2_T1IS_POSITION                      0x00000018
#define _IPC2_T1IS_MASK                          0x03000000
#define _IPC2_T1IS_LENGTH                        0x00000002

#define _IPC2_T1IP_POSITION                      0x0000001A
#define _IPC2_T1IP_MASK                          0x1C000000
#define _IPC2_T1IP_LENGTH                        0x00000003

#define _IPC2_w_POSITION                         0x00000000
#define _IPC2_w_MASK                             0xFFFFFFFF
#define _IPC2_w_LENGTH                           0x00000020

#define _IPC3_CMP1IS_POSITION                    0x00000000
#define _IPC3_CMP1IS_MASK                        0x00000003
#define _IPC3_CMP1IS_LENGTH                      0x00000002

#define _IPC3_CMP1IP_POSITION                    0x00000002
#define _IPC3_CMP1IP_MASK                        0x0000001C
#define _IPC3_CMP1IP_LENGTH                      0x00000003

#define _IPC3_CMP2IS_POSITION                    0x00000008
#define _IPC3_CMP2IS_MASK                        0x00000300
#define _IPC3_CMP2IS_LENGTH                      0x00000002

#define _IPC3_CMP2IP_POSITION                    0x0000000A
#define _IPC3_CMP2IP_MASK                        0x00001C00
#define _IPC3_CMP2IP_LENGTH                      0x00000003

#define _IPC3_RTCCIS_POSITION                    0x00000010
#define _IPC3_RTCCIS_MASK                        0x00030000
#define _IPC3_RTCCIS_LENGTH                      0x00000002

#define _IPC3_RTCCIP_POSITION                    0x00000012
#define _IPC3_RTCCIP_MASK                        0x001C0000
#define _IPC3_RTCCIP_LENGTH                      0x00000003

#define _IPC3_AD1IS_POSITION                     0x00000018
#define _IPC3_AD1IS_MASK                         0x03000000
#define _IPC3_AD1IS_LENGTH                       0x00000002

#define _IPC3_AD1IP_POSITION                     0x0000001A
#define _IPC3_AD1IP_MASK                         0x1C000000
#define _IPC3_AD1IP_LENGTH                       0x00000003

